tests/paVerifyPaymentNoticeReq/OK-no-payment-list.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <paf:paVerifyPaymentNoticeRes>
         <outcome>OK</outcome>
         <!--Optional:-->
         
      </paf:paVerifyPaymentNoticeRes>
   </soapenv:Body>
</soapenv:Envelope>