src/fixtures/fixVerifyResponse.ts

export const paVerify17 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>true</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify18 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>false</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify19 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>false</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify20 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>false</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify21 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>false</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify22 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>true</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;
